In [16]:
#import file as csv
import os
import pandas as pd

file_path = "Resources/ufo_sightings_scrubbed.csv"
ufo_file = pd.read_csv(file_path)

ufo_file.head()
ufo_file["country"].value_counts()

C:\Users\winst\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3049: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

In [19]:
#only look at US for country

ufo_file = ufo_file.dropna(how='any')

#ufo_file["country"].value_counts()

ufo_file = ufo_file.loc[ufo_file['country']== 'us',:]

ufo_file["country"].value_counts()

us    63553
Name: country, dtype: int64

In [20]:
ufo_file.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611
5,10/10/1961 19:00,bristol,tn,us,sphere,300,5 minutes,My father is now 89 my brother 52 the girl wit...,4/27/2007,36.5950000,-82.188889
7,10/10/1965 23:45,norwalk,ct,us,disk,1200,20 minutes,A bright orange color changing to reddish colo...,10/2/1999,41.1175000,-73.408333

In [22]:
ufo_file.to_csv("Resources/ufo_clean.csv")